---
kind: method
id: M:Autodesk.Revit.DB.WireframeBuilder.Reset
source: html/283c0e09-d090-d0e3-0b67-5b0b76dc7f2d.htm
---
# Autodesk.Revit.DB.WireframeBuilder.Reset Method

Clears the accumulated geometry.

## Syntax (C#)
```csharp
public void Reset()
```